export const RFT = [
  { RELY: [0.75, 0.88, 1, 1.15, 1.4, 0], name: `Требуемая надежность ПО` },
  { DATA: [0, 0.94, 1, 1.08, 1.16, 0], name: `Размер БД приложения` },
  { CPLX: [0.7, 0.85, 1, 1.15, 1.3, 1.65], name: `Сложность продукта` },
  { TIME: [0, 0, 1, 1.11, 1.3, 1.66], name: `Требования к быстродействию` },
  { STOR: [0, 0, 1, 1.06, 1.21, 1.56], name: `Ограничения памяти` },
  { VIRT: [0, 0.87, 1, 1.15, 1.3, 0], name: `Неустойчивость окружения` },
  { TURN: [0, 0.87, 1, 1.07, 1.15, 0], name: `Время восстановления` },
  { ACAP: [1.46, 1.19, 1, 0.86, 0.71, 0], name: `Аналитические способности` },
  { AEXP: [1.42, 1.17, 1, 0.86, 0.7, 0], name: `Способности к разработке ПО` },
  { PCAP: [1.29, 1.13, 1, 0.91, 0.82], name: `Опыт разработки` },
  {
    VEXP: [1.21, 1.1, 1, 0.9, 0, 0],
    name: `Опыт использования виртуальных машин`
  },
  { LEXP: [1.14, 1.07, 1, 0.95, 0, 0], name: `Опыт языка` },
  { MODR: [1.24, 1.1, 1, 0.91, 0.82, 0], name: `Инструменты разработки` },
  { TOOL: [1.24, 1.1, 1, 0.91, 0.83, 0], name: `Методы разработки` },
  { SCED: [1.23, 1.08, 1, 1.04, 1.1, 0], name: `График разработки` }
];
export const PARAM = {
  0: "Очень низкий",
  1: "низкий",
  2: "Средний",
  3: "Высокий",
  4: "Очень высокий",
  5: "Критический"
};
export const RFTSelected = {
  RELY: {
    RELY: [0.75, 0.88, 1, 1.15, 1.4, 0],
    name: `Требуемая надежность ПО`
  },
  DATA: { DATA: [0, 0.94, 1, 1.08, 1.16, 0], name: `Размер БД приложения` },
  CPLX: { CPLX: [0.7, 0.85, 1, 1.15, 1.3, 1.65], name: `Сложность продукта` },
  TIME: {
    TIME: [0, 0, 1, 1.11, 1.3, 1.66],
    name: `Требования к быстродействию`
  },
  STOR: { STOR: [0, 0, 1, 1.06, 1.21, 1.56], name: `Ограничения памяти` },
  VIRT: { VIRT: [0, 0.87, 1, 1.15, 1.3, 0], name: `Неустойчивость окружения` },
  TURN: { TURN: [0, 0.87, 1, 1.07, 1.15, 0], name: `Время восстановления` },
  ACAP: {
    ACAP: [1.46, 1.19, 1, 0.86, 0.71, 0],
    name: `Аналитические способности`
  },
  AEXP: {
    AEXP: [1.42, 1.17, 1, 0.86, 0.7, 0],
    name: `Способности к разработке ПО`
  },
  PCAP: { PCAP: [1.29, 1.13, 1, 0.91, 0.82], name: `Опыт разработки` },
  VEXP: {
    VEXP: [1.21, 1.1, 1, 0.9, 0, 0],
    name: `Опыт использования виртуальных машин`
  },
  LEXP: { LEXP: [1.14, 1.07, 1, 0.95, 0, 0], name: `Опыт языка` },
  MODR: { MODR: [1.24, 1.1, 1, 0.91, 0.82, 0], name: `Инструменты разработки` },
  TOOL: { TOOL: [1.24, 1.1, 1, 0.91, 0.83, 0], name: `Методы разработки` },
  SCED: { SCED: [1.23, 1.08, 1, 1.04, 1.1, 0], name: `График разработки` }
};
